Tekla.Structures.DirectManipulation.Model.Native.DirectManipulationImports
The Tekla.Structures.DirectManipulation.Model.Native.DirectManipulationImports class is a static wrapper class providing methods for invoking native code through DllImport.

Tekla.Structures.DirectManipulation.Model.Native.DirectManipulationImports.#cctor
Initializes static members of the Tekla.Structures.DirectManipulation.Model.Native.DirectManipulationImports class.

Tekla.Structures.DirectManipulation.Model.Native.DirectManipulationImports.NativeDllImport
Gets the native DLL import.
The native DLL import.

Tekla.Structures.DirectManipulation.Model.Native.DirectManipulationImports.ExportPointListHandler(Tekla.Structures.ModelInternal.dotnetPointList_t@)
Exports the point list handler.
pointList: The point list.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.DirectManipulationImports.ImportPointListHandler(Tekla.Structures.ModelInternal.dotnetPointList_t@)
Imports the point list handler.
pointList: The point list.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.DirectManipulationImports.ExportIntListHandler(Tekla.Structures.ModelInternal.dotnetIntList_t@)
Exports the int list handler.
intList: The integer list.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.DirectManipulationImports.ImportIntListHandler(Tekla.Structures.ModelInternal.dotnetIntList_t@)
Imports the int list handler.
intList: The integer list.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.DirectManipulationImports.ExportDoubleListHandler(Tekla.Structures.ModelInternal.dotnetDoubleList_t@)
Exports the double list handler.
doubleList: The double list.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.DirectManipulationImports.ImportDoubleListHandler(Tekla.Structures.ModelInternal.dotnetDoubleList_t@)
Imports the double list handler.
doubleList: The double list.
Returns: Greater than 0 on success.